var games = [
  {
    "比賽編號" : 3,
    "比賽日期" : "2020-10-04",
    "比賽名稱" : "第一屆室內三鐵挑戰賽",
    "比賽說明" : "無",
    "時間範圍" : "08:00~17:00",  
    "截止時間" : "2020-09-30 18:00",
    "隊數限制" : 5,
    "報名人數" : 12,
    "比賽種類" : "三人綜合", 
    "比賽距離" : "跑步機: 10公里 ,飛輪車: 30公里 ,划船器: 2000公尺",  
    "學院系所" : ["1:理學院,1:數學系",
                 "2:工學院,0:工學院",            
                 "4:人文社會學院,7:哲學研究所",            
                 "8:清華學院,2:體育室",            
                 "11:藝術學院,1:音樂學系",            
               ],
  },
  {
    "比賽編號" : 4,
    "比賽日期" : "2020-11-04",
    "比賽名稱" : "30公里跑步賽",
    "比賽說明" : "無",    
    "時間範圍" : "08:00~17:00",  
    "截止時間" : "2020-10-31 18:00",
    "隊數限制" : 5,
    "報名人數" : 3,
    "比賽種類" : "個人飛輪", 
    "比賽距離" : "飛輪車: 30公里",   
    "學院系所" : [],   
  }                        
];

var 報名名單3 = {
  "比賽編號" : 3,
  "隊伍" : {
    "T1": {
          "學院系所": "1:理學院,1:數學系",
          "報名者": {
            "第一位": { "運動": "跑步", "姓名": "AA1" },
            "第二位": { "運動": "飛輪", "姓名": "BB1" }, 
            "第三位": { "運動": "划船", "姓名": "CC1" },
          }   
         },
    "T2": {
          "學院系所": "2:工學院,0:工學院",
          "報名者": {
            "第一位": { "運動": "跑步", "姓名": "AA2" },
            "第二位": { "運動": "飛輪", "姓名": "BB2" }, 
            "第三位": { "運動": "划船", "姓名": "CC2" },
          }   
         },
    "T3": {
          "學院系所": "4:人文社會學院,7:哲學研究所",
          "報名者": {
            "第一位": { "運動": "跑步", "姓名": "" },
            "第二位": { "運動": "飛輪", "姓名": "BB3" }, 
            "第三位": { "運動": "划船", "姓名": "CC3" },
          }   
         },
    "T4": {
          "學院系所": "8:清華學院,2:體育室",
          "報名者": {
            "第一位": { "運動": "跑步", "姓名": "AA4" },
            "第二位": { "運動": "飛輪", "姓名": "" }, 
            "第三位": { "運動": "划船", "姓名": "CC4" },
          }   
         },
    "T5": {
          "學院系所": "11:藝術學院,1:音樂學系",
          "報名者": {
            "第一位": { "運動": "跑步", "姓名": "AA5" },
            "第二位": { "運動": "飛輪", "姓名": "BB5" }, 
            "第三位": { "運動": "划船", "姓名": "" },
          }   
         },    
  }
}

var 報名名單4 = {
  "比賽編號" : 4,
  "隊伍" : {
    "T1": {
          "學院系所": "",
          "報名者": {
            "第一位": { "運動": "飛輪", "姓名": "AA1" }, 
          }   
         },
    "T2": {
          "學院系所": "",
          "報名者": {
            "第一位": { "運動": "飛輪", "姓名": "AA2" }, 
          }   
         },
    "T3": {
          "學院系所": "",
          "報名者": {
            "第一位": { "運動": "飛輪", "姓名": "AA3" }, 
          }   
         }, 
    "T4": {
          "學院系所": "",
          "報名者": {
            "第一位": { "運動": "飛輪", "姓名": "" }, 
          }   
         }, 
    "T5": {
          "學院系所": "",
          "報名者": {
            "第一位": { "運動": "飛輪", "姓名": "" }, 
          }   
         },     
  }
}


