var gamehistory = [
  {
    比賽編號 : 2,
    直播連結 : "",
    比賽日期 : "2020-03-04",
    比賽名稱 : "(測試)室內三鐵挑戰賽",
    比賽說明 : "無",
    時間範圍 : "08:00~17:00",  
    截止時間 : "2020-09-30 18:00",
    隊數限制 : 2,
    報名人數 : 4,
    比賽種類 : "三人三鐵", 
    比賽距離 : "跑步機: 10公里 ,飛輪車: 30公里 ,划船器: 2000公尺",  
    學院系所 : ["8:清華學院,2:體育室",            
               "11:藝術學院,1:音樂學系",            
              ]
  },
  {
    比賽編號 : 1,
    直播連結 : "",
    比賽日期 : "2020-01-04",
    比賽名稱 : "(測試)30公里跑步賽",
    比賽說明 : "無",    
    時間範圍 : "08:00~17:00",  
    截止時間 : "2020-10-31 18:00",
    隊數限制 : 3,
    報名人數 : 3,
    比賽種類 : "個人跑步", 
    比賽距離 : "跑步機: 30公里",   
    學院系所 : []    
  }            
            
];